tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
brew "openjdk"
brew "ant"
brew "bento4"
brew "docker"
brew "tesseract"
brew "ffmpeg"
brew "http-server"
brew "node@20"
brew "nvm"
brew "parallel"
brew "pwntools"
brew "python@3.8"
brew "qemu"
brew "redis"
brew "sl"
brew "tmux"
brew "tree"
brew "vercel-cli"
brew "wget"
brew "youtube-dl"
brew "yt-dlp"
cask "appcleaner"
cask "arc"
cask "brave-browser"
cask "chromedriver"
cask "discord"
cask "fig"
cask "firefox"
cask "font-meslo-for-powerlevel10k"
cask "font-monaspace"
cask "google-chrome"
cask "ilspy"
cask "iterm2"
cask "microsoft-edge"
cask "minecraft"
cask "mongodb-compass"
cask "ngrok"
cask "notion"
cask "notion-calendar"
cask "obs"
cask "overlayed"
cask "pgadmin4"
cask "postman"
cask "prettyclean"
cask "raycast"
cask "tiles"
cask "tor-browser"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "zulu@17"
cask "zulu@8"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "bradlc.vscode-tailwindcss"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "csstools.postcss"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "eriklynd.json-tools"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "icrawl.discord-vscode"
vscode "jannisx11.batch-rename-extension"
vscode "mariusalchimavicius.json-to-ts"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "naumovs.color-highlight"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "ritwickdey.liveserver"
vscode "shardulm94.trailing-spaces"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "streetsidesoftware.code-spell-checker"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "wallabyjs.console-ninja"
vscode "yoavbls.pretty-ts-errors"
vscode "zhang-renyang.vscode-react"
