tap "chipsalliance/verible"
tap "golangci/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "oven-sh/bun"
tap "stripe/stripe-cli"
brew "harfbuzz"
brew "openjdk"
brew "ant"
brew "arm-linux-gnueabihf-binutils"
brew "python@3.12"
brew "awscli"
brew "bash"
brew "bat"
brew "bazel"
brew "bento4"
brew "bison"
brew "boost"
brew "boost-python3"
brew "cmake"
brew "displayplacer"
brew "eigen"
brew "fastfetch"
brew "svt-av1"
brew "tesseract"
brew "ffmpeg"
brew "flex"
brew "freeglut"
brew "fswatch"
brew "gawk"
brew "gcc"
brew "gh"
brew "gifski"
brew "git"
brew "go"
brew "pkgconf"
brew "graphviz"
brew "hidapi"
brew "http-server"
brew "icarus-verilog"
brew "jose"
brew "jq"
brew "libffi", link: true
brew "libusb"
brew "libftdi"
brew "libusb-compat"
brew "llvm"
brew "neovim"
brew "ninja"
brew "node@20"
brew "nvm"
brew "open-ocd"
brew "openfpgaloader"
brew "parallel"
brew "pnpm"
brew "postgresql@14"
brew "pre-commit"
brew "protobuf"
brew "pwntools"
brew "qemu"
brew "qt@5"
brew "redis"
brew "sbt"
brew "sl"
brew "snapcraft"
brew "spades"
brew "svls"
brew "tio"
brew "tmux"
brew "tree"
brew "universal-ctags"
brew "vercel-cli"
brew "verilator"
brew "wget"
brew "wmctrl"
brew "x86_64-elf-gcc"
brew "xdot"
brew "yosys"
brew "youtube-dl"
brew "yt-dlp"
brew "chipsalliance/verible/verible"
brew "golangci/tap/golangci-lint"
brew "oven-sh/bun/bun"
brew "stripe/stripe-cli/stripe"
cask "appcleaner"
cask "arc"
cask "betterdisplay"
cask "brave-browser"
cask "chromedriver"
cask "discord"
cask "docker"
cask "drawio"
cask "firefox"
cask "font-athiti"
cask "font-chakra-petch"
cask "font-charmonman"
cask "font-itim"
cask "font-meslo-for-powerlevel10k"
cask "font-monaspace"
cask "fork"
cask "ghostty@tip"
cask "gimp"
cask "google-chrome"
cask "google-drive"
cask "hex-fiend"
cask "ilspy"
cask "imageoptim"
cask "intellij-idea-ce"
cask "iterm2"
cask "keyboardcleantool"
cask "macs-fan-control"
cask "microsoft-edge"
cask "minecraft"
cask "mongodb-compass"
cask "mysql-shell"
cask "ngrok"
cask "notion"
cask "obs"
cask "pgadmin4"
cask "playcover-community"
cask "postman"
cask "prettyclean"
cask "slack"
cask "spotify"
cask "streamlabs"
cask "thunderbird"
cask "tiles"
cask "utm"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "xquartz"
cask "zulu"
cask "zulu@17"
cask "zulu@8"
vscode "alexkrechik.cucumberautocomplete"
vscode "bradlc.vscode-tailwindcss"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "eamodio.gitlens"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "eriklynd.json-tools"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "icrawl.discord-vscode"
vscode "imagio.vscode-dimmer-block"
vscode "leodevbro.blockman"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-typescript-next"
vscode "naumovs.color-highlight"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "pulkitgangwar.nextjs-snippets"
vscode "ritwickdey.liveserver"
vscode "shakram02.bash-beautify"
vscode "shardulm94.trailing-spaces"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "streetsidesoftware.code-spell-checker"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "vivekmalneedi.veridian"
vscode "wallabyjs.console-ninja"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
