tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "oven-sh/bun"
brew "python@3.12"
brew "openjdk"
brew "ant"
brew "bash"
brew "bento4"
brew "bison"
brew "boost"
brew "boost-python3"
brew "cmake"
brew "docker"
brew "eigen"
brew "tesseract"
brew "ffmpeg"
brew "flex"
brew "fswatch"
brew "gawk"
brew "gcc"
brew "git"
brew "pkg-config"
brew "graphviz"
brew "http-server"
brew "jq"
brew "libffi"
brew "libftdi"
brew "llvm"
brew "ninja"
brew "node@20"
brew "nvm"
brew "openfpgaloader"
brew "parallel"
brew "pnpm"
brew "pwntools"
brew "python@3.8"
brew "qemu"
brew "qt@5"
brew "redis"
brew "sl"
brew "snapcraft"
brew "spades"
brew "tmux"
brew "tree"
brew "vercel-cli"
brew "wget"
brew "x86_64-elf-gcc"
brew "xdot"
brew "yosys"
brew "youtube-dl"
brew "yt-dlp"
brew "oven-sh/bun/bun"
cask "appcleaner"
cask "arc"
cask "brave-browser"
cask "chromedriver"
cask "discord"
cask "firefox"
cask "font-athiti"
cask "font-chakra-petch"
cask "font-charmonman"
cask "font-itim"
cask "font-meslo-for-powerlevel10k"
cask "font-monaspace"
cask "fork"
cask "google-chrome"
cask "ilspy"
cask "iterm2"
cask "microsoft-edge"
cask "minecraft"
cask "mongodb-compass"
cask "ngrok"
cask "notion"
cask "notion-calendar"
cask "obs"
cask "pgadmin4"
cask "postman"
cask "prettyclean"
cask "raycast"
cask "spotify"
cask "tiles"
cask "tor-browser"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "zulu"
cask "zulu@17"
cask "zulu@8"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "astro-build.astro-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "csstools.postcss"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "eriklynd.json-tools"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "icrawl.discord-vscode"
vscode "mariusalchimavicius.json-to-ts"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "mshr-h.veriloghdl"
vscode "naumovs.color-highlight"
vscode "oven.bun-vscode"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "ritwickdey.liveserver"
vscode "shardulm94.trailing-spaces"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "streetsidesoftware.code-spell-checker"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "wallabyjs.console-ninja"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "zhang-renyang.vscode-react"
